import Question from "./Question.jsx"

export const QUESTIONSDATA = [
    {
        kind: "מתמטית-לוגית",
        checked: 0,
        number: 0,
        color: "#33A9AC",
        data: [
            {
                question: "אני מחשב/ת מספרים בראש בקלות",
                check: false,
            },
            {
                question: "מתמטיקה ומדעים הם המקצועות האהובים עליי",
                check: false,
            }, {
                question: "אני אוהב/ת משחקים וחידות היגיון",
                check: false,
            }, {
                question: 'אני אוהב/ת לערוך ניסויים קטנים (בבית, במטבח…)',
                check: false,
            }, {
                question: "אני עוקב/ת אחר התפתחויות מדעיות חדשות",
                check: false,
            }, {
                question: "אני שואל/ת שאלות רבות לגבי הדרך שבה דברים פועלים",
                check: false,
            }, {
                question: "אני אוהב/ת חידות עם מספרים",
                check: false,
            }, {
                question: "אני מרגיש/ה יותר בנוח עם דברים שנבחנו, נמדדו או כומתו בדרך כלשהי",
                check: false,
            }, {
                question: "אני מחפש/ת לכל דבר הסבר רציונלי",
                check: false,
            },
            {
                question: "אני זוכר/ת בקלות מספרים",
                check: false,
            }
        ],
        text: [
            "חכמת היגיון/מספר",
            [
                `כלומד`,
                `ארגן את החומר תחת סעיפים, תרשימי זרימה, גרפים וטבלאות`,
                `הבן את הרציונל מאחורי החומר הנלמד`,
                `חברי כמה נושאים יחד לפי היגיון כדי לזכור איך הכל משתלב`,
            ],
            [
                `כמדריך`,
                `לאפשר חלוקה לקבוצות כשיש קבוצה של אנשים עם אינטליגנציה זו, הם עובדים טוב ספציפית יחד`,
                `פעילויות של חשיבה, פענוח קודים, דפוסים`,
                `בקשי מהחניך להכין טבלה או תרשים שמסכמים את החומר`,
            ]

        ]

    },
    {
        kind: "מרחבית/חזותית",
        checked: 0,
        number: 1,
        color: "#Ffa646",
        data: [

            {
                question: 'כשאני עוצמ/ת עיניים אני בדרך כלל רואה תמונות ברורות',
                check: false,
            },
            {
                question: 'אני רגיש/ה לצבע',
                check: false,
            }, {
                question: 'אני אוהב/ת להסתכל בתמונות (בספרים, תערוכות)',
                check: false,
            }, {
                question: 'אני מתעניינת/ במבנים, בעיצובי פנים וחוץ של בניינים ובתים',
                check: false,
            }, {
                question: 'אני אוהב/ת משחקי הרכבה, מבוכים ומשחקים חזותיים אחרים',
                check: false,
            }, {
                question: 'באופן כללי אני יכול/ה למצוא את דרכי במקום לא מוכר',
                check: false,
            }, {
                question: 'אני אוהב/ת לשרבט, לצייר',

                check: false,
            }, {
                question: 'אני יכול/ה לדמיין בקלות איך משהו יראה, למשל ממעוף הציפור',
                check: false,
            }, {
                question: 'כשאני בחנות רהיטים, אני יכול/ה לדמיין בקלות איך הרהיטים משתלבים בחדרי',
                check: false,
            }, {
                question: 'אני אוהב/ת פעילות הנושאת אופי אמנותי',
                check: false,
            },
        ],
        text: [
            `חכמת תמונה ומקום`,
            [
                ` כלומד`,
                `צור המחשה ויזואלית לחומר, העדפה לתלת מימדית`,
                `נסה לזכור דברים לפי מיקומים`,
                `התנסה כמה שיותר פיזית`,
            ],
            [
                `כמדריך`,
                `המחשה דרך מודל`,
                `לאפשר ללומדים ליצור עם הידיים`,
                `הדרכות בחוץ על דברים פיזיים`
            ]
        ]
    },
    {
        kind: "תנועתית",
        checked: 0,
        number: 2,
        color: "#982062",
        data: [
            {
                question: "אני עוסק/ת באופן קבוע בספורט כלשהו או בפעילות גופנית",
                check: false,
            }, {
                question: "אני זז/ה, מתופפ/ת או מגלה חוסר מנוחה כאשר יושב/ת במקום אחד הרבה זמן",
                check: false,
            }, {
                question: "אני אוהב/ת לעבוד בידיים – לתפור, לרקום, לגלף וכו'",
                check: false,
            }, {
                question: "כשאני לומד/ת מיומנות חדשה אני מוכרח/ה לתרגל אותה",
                check: false,
            }, {
                question: "הרעיונות הטובים ביותר עולים בדעתי בשעת פעילות פיזית",
                check: false,
            }, {
                question: "בשעת שיחה אני מרבה להשתמש בתנועות ידיים וגוף",
                check: false,
            }, {
                question: "לרוב כשאני מאזינ/ה למוזיקה אני מתנועעת",
                check: false,
            }, {
                question: "אני אוהב/ת לפרק דברים ואחר להרכיבם מחדש",
                check: false,
            }, {
                question: "אני אוהב/ת לגעת בכל דבר שאני רואה",
                check: false,
            }, {
                question: "אני אוהב/ת משחקי כדור",
                check: false,
            },
        ],
        text: [
            `חכמת גוף`,
            [
                `כלומד:`,
                `קח הפסקות בלמידה כדי ללכת, לרוץ, לעשות פעילות גופנית`,
                `דבר בקול תוך כדי הליכה כשאתה לומד כדי לשנן`
            ],
            [
                `כמדריך`,
                `משחקים בכיתה בהם החניכים נדרשים לתנועה ממקום למקום`,
                `לאפשר הפסקות ובקש מחניך לא מרוכז לצאת לריצה קצרה ולחזור`
            ]
        ]

    },
    {
        kind: "בין אישית",
        checked: 0,
        number: 3,
        color: "#F86041",
        data: [
            {
                question: "אנשים נוטים להתייעץ איתי בנושאים שונים",
                check: false,
            }, {
                question: "אני בדרך כלל משתפ/ת אנשים בחוויות שלי, בהתלבטויות, בהחלטות וכדומה",
                check: false,
            }, {
                question: "יש לי לפחות שלושה חברים טובים",
                check: false,
            }, {
                question: "אני בדרך כלל משתפ/ת אנשים בחוויות שלי, בהתלבטויות, בהחלטות וכדומה",
                check: false,
            }, {
                question: "יש לי כושר מנהיגות",
                check: false,
            }, {
                question: "אני נוטה לסייע לאנשים להתמודד עם קשיים שלהם",
                check: false,
            }, {
                question: "אני אוהב/ת את חברת בני/בנות גילי",
                check: false,
            }, {
                question: "אני אוהב/ת להקשיב לאחרים",
                check: false,
            }, {
                question: "אומרים עליי שאני שומר/ת סוד",
                check: false,
            }, {
                question: "אני מבחינ/ה היטב במצבי רוח של אחרים",
                check: false,
            },

        ],
        text: [
            `חכמת אנשים`,
            [`כלומד:`,
                ` למד אדם אחר`,
                ` למדי בקבוצה, הנחי קבוצה`,
                ` נסה להבין את האנשים מאחורי הסיפורים שאתה לומד`
            ],
            [
                `כמדריך`,
                ` לתת לחניך אחריות להעביר תוכן לקבוצה`,
                ` לתת לחניך ללמד מישהו חלש ממנו`,
                ` להשתמש בשיטת למידת עמיתים, למידה בקבוצות`
            ]
        ]
    },
    {
        kind: "תוך אישית",
        checked: 0,
        number: 4,
        color: "#4fb0e4",
        data: [
            {
                question: "אני מהרהר/ת הרבה על דברים שאני עומד/ת לבצע, או לאחר מעשה",
                check: false,
            }, {
                question: "אני מסוגל/ת ללמוד מכישלונות",
                check: false,
            }, {
                question: "יש לי תחומי עניין שאני שומר/ת לעצמי",
                check: false,
            }, {
                question: "אני מכוונ/ת את עצמי ליעדים שקבעתי לעצמי בחיים",
                check: false,
            }, {
                question: "אני מודע/ת ליכולותיי ולחולשותיי",
                check: false,
            }, {
                question: "אני בעל/ת חשיבה עצמאית",
                check: false,
            }, {
                question: "אני כותב/ת יומן",
                check: false,
            }, {
                question: "אני מעדיפ/ה לעבוד לבד מאשר בקבוצה",
                check: false,
            }, {
                question: "אני יודע/ת לבטא היטב את תחושותיי ורגשותיי",
                check: false,
            }, {
                question: "אני יודע/ת להקשיב לעצמי (להיות מודעת לרגשותיי, רצונותיי, צרכיי וכדומה)",
                check: false,
            },
        ],
        text: [
            `חכמה עצמית`,
            [
                ` כלומד:`,
                `- שפר את הריכוז שלך ע''י מיינדפולנס/מדיטציה`,
                `- למדי בשקט, לבד, נושאים שמאתגרים אותך`,
                `- בקש לקבל תרגול נוסף או חוברת חזרה כדי ללמוד באופן עצמאי`
            ],
            [
                `איך להדריך אנשים מסוג זה:`,
                `- השתמש בכלי הרפלקציה, לחבר את החניך למודעות עצמית ולתת מקום לאני הפנימי שלו `,
                `- אפשר שיטת למידה עצמאית, למידה ותרגול עצמאיים`,
                `- תני מקום לחניכים שצריכים זמן לעצמם ולאחד על אחד איתך`
            ]
        ]
    },
    {
        kind: "לשונית",
        checked: 0,
        number: 5,
        color: "#beca11",
        data: [
            {
                question: "אני אוהב/ת לספר סיפורים",
                check: false,
            }, {
                question: "אני אוהב/ת להקשיב לדיבור: סיפור, רדיו וכו'",
                check: false,
            }, {
                question: "אני אוהב/ת משחקים עם מילים כגון שבץ נא, ושעשועי מילים כגון תשבצים.",
                check: false,
            }, {
                question: "המקצועות ספרות, היסטוריה ואזרחות אהובים עליי יותר מפיזיקה, מתמטיקה וכימיה",
                check: false,
            }, {
                question: "כשאני נוסע/ת אני שמ/ה לב למילים על השלטים ולוחות המודעות יותר מאשר לנוף",
                check: false,
            }, {
                question: "דברים שאני כותב/ת זוכים להערכתם של אחרים",
                check: false,
            }, {
                question: "אני אוהב/ת לקרוא",
                check: false,
            }, {
                question: "אני בעל/ת זיכרון טוב לשמות מקומות, לפרטים",
                check: false,
            }, {
                question:"אני בעל/ת אוצר מילים רחב יחסית",
                check: false,
            }, {
                question: "אני אוהבת/ חרוזים",
                check: false,
            },
        ],
        text: [
            [
            `חכמת מילה`,
            ],
            [
                `כלומד:`,
                `תכתוב לעצמך הכל, סמן דברים לזכור וצור ראשי תיבות`,
                `המציאי שירים לזכירת סדר פעולות`,
                `דברי בפני אנשים`,
            ],
            [
                `איך להדריך אנשים מסוג זה:`,
                `שיטת למידה של דיבייט`,
                `שיטת למידה של דיון`,
                `קבוצת למידה של בעלי אינטילגנציה זו שיכתבו שירים או תסריטים על החומר`
            ]
        ]
    }
]